Ran Plan for project: `prod-emnify` dir: `finance_revenue_report_s3_to_redshift/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.business-etl.aws_glue_crawler.csv_crawler will be updated in-place
~ resource "aws_glue_crawler" "csv_crawler" {
        arn           = "arn:aws:glue:eu-west-1:884047677700:crawler/prod-emnify-csv"
        classifiers   = [
            "prod-emnify-business-etl-csv-classifier",
        ]
        database_name = "prod-emnify-business-etl-csv"
        id            = "prod-emnify-csv"
        name          = "prod-emnify-csv"
        role          = "glue_iam_role"
        schedule      = "cron(0 0 * * ? *)"
        tags          = {}

      ~ s3_target {
            exclusions = []
          ~ path       = "s3://prod-emnify-business-etl-invoice-csv/" -> "prod-emnify-business-etl-invoice-csv/"
        }

        schema_change_policy {
            delete_behavior = "DEPRECATE_IN_DATABASE"
            update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.business-etl.aws_glue_job.s3_to_redshift_etl will be updated in-place
~ resource "aws_glue_job" "s3_to_redshift_etl" {
        allocated_capacity = 2
        arn                = "arn:aws:glue:eu-west-1:884047677700:job/prod-emnify-s3-to-redshift-etl"
        connections        = [
            "prod-emnify-redshift",
        ]
      ~ default_arguments  = {
            "--CATALOG"                          = "prod-emnify-business-etl-catalog"
            "--REDSHIFT_CONNECTION"              = "prod-emnify-redshift"
          ~ "--TempDir"                          = "s3://aws-glue-prod-emnify-business-etl-temp-eu-west-1" -> "s3://prod-emnify-business-etl-eu-west-1-aws-glue-script"
            "--enable-continuous-cloudwatch-log" = "true"
            "--enable-metrics"                   = ""
            "--job-bookmark-option"              = "job-bookmark-enable"
            "--job-language"                     = "python"
        }
        description        = "glue job for uploading data from S3 to Redshift"
        glue_version       = "1.0"
        id                 = "prod-emnify-s3-to-redshift-etl"
        max_capacity       = 2
        max_retries        = 0
        name               = "prod-emnify-s3-to-redshift-etl"
        number_of_workers  = 0
        role_arn           = "arn:aws:iam::884047677700:role/glue_iam_role"
        tags               = {}
        timeout            = 180

      ~ command {
            name            = "glueetl"
            python_version  = "3"
          ~ script_location = "s3://aws-glue-prod-emnify-business-etl-temp-eu-west-1/prod-emnify-load_data_from_S3ToRedshift.py" -> "s3://prod-emnify-business-etl-eu-west-1-aws-glue-script/prod-emnify-load_data_from_S3ToRedshift.py"
        }

        execution_property {
            max_concurrent_runs = 1
        }
    }

  # module.business-etl.aws_s3_bucket.finance_etl_glue_script_bucket is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "finance_etl_glue_script_bucket" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::prod-emnify-business-etl-eu-west-1-aws-glue-script" -> (known after apply)
        bucket                      = "prod-emnify-business-etl-eu-west-1-aws-glue-script"
      ~ bucket_domain_name          = "prod-emnify-business-etl-eu-west-1-aws-glue-script.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "prod-emnify-business-etl-eu-west-1-aws-glue-script.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "prod-emnify-business-etl-eu-west-1-aws-glue-script" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Application" = "business-etl"
            "Instance"    = "emnify"
            "Name"        = "glue_temp_script_bucket"
            "Stage"       = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

  # module.business-etl.aws_s3_bucket_object.s3_to_redshift_script will be created
+ resource "aws_s3_bucket_object" "s3_to_redshift_script" {
      + acl                    = "private"
      + bucket                 = "prod-emnify-business-etl-eu-west-1-aws-glue-script"
      + content_type           = (known after apply)
      + etag                   = "776bcec35d77151c9015b9661558961a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "prod-emnify-load_data_from_S3ToRedshift.py"
      + server_side_encryption = (known after apply)
      + source                 = "../../finance_revenue_report_s3_to_redshift/load_data_from_S3ToRedshift.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Application" = "business-etl"
          + "Instance"    = "emnify"
          + "Name"        = "load_data_from_S3ToRedshift.py"
          + "Stage"       = "prod"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod-emnify`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.oss-eks.emnify.net/lock?id=EMnify%252Fbusiness-etl%252Ffinance_revenue_report_s3_to_redshift%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod-emnify`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
